feat/ai: rewrite authn design
